# Opdrachten sectie 4

In [1]:
%LOAD ../data/employees.db

:::{exercise}
Query 1: Maak een overzicht met de namen van de werknemers en hun nieuwe e-mailadressen zoals in onderstaand overzicht. Als er een spatie in de naam staat (zoals bij 'De Haan'), zal die spatie uit de naam moeten worden gehaald. Alles staat in kleine letters en het e-mailadres bestaat uit de eerste letter van de voornaam, gevolgd door een punt en daarna de achternaam met daaraan vastgeplakt de bedrijfsnaam. Er is gesorteerd op achternaam.

![](figs/clip0220.png)
 
:::

:::{exercise}
Query 2: Vervang in de tabel jobs alle job_titles waarin 'Manager' voorkomt het woord 'Manager' door 'Director'.

![](figs/clip0222.png)

:::

:::{exercise}
Query 3: Om in te loggen maken de werknemers gebruik van een inlognaam die bestaat uit de eerste letter van de voornaam en de eerste letter van de achternaam, aan elkaar en in kleine letters. Maak een overzicht van de inlognamen en sorteer op de achternaam.

![](figs/clip0223.png)

:::

:::{exercise}
Query 4: Maak een overzicht van de salarissen zoals in onderstaand overzicht. In de tweede kolom staat het maandsalaris afgerond op nul decimalen. Uitgaande van een 36 urige werkweek en vier weken in een maand staat dan in de derde kolom wat zo'n werknemer per uur verdient in twee decimalen. In de vierde kolom is dat naar beneden afgerond en in de vijfde kolom naar boven. Er is gesorteerd op achternaam.

![](figs/clip0224.png)

:::

:::{exercise}
Query 5: Maak een overzicht zoals hieronder. De gegevens komen uit de tabel job_history. De datums zijn in het Nederlands (maanden met een kleine letter bijvoorbeeld) en er is geen voorloopnul gebruikt bij de dag (geen 01 januari maar 1 januari bijvoorbeeld). Er is gesorteerd op employee_id.

![](figs/clip0225.png)

:::

:::{exercise}
Query 6: De grote baas (King) wil een overzicht van welke werknemers binnenkort 35 jaar in dienst zijn. King wil zichzelf niet op de lijst en slechts de vijf eerste werknemers die in aanmerking komen worden getoond. Let op het formaat van de datum. Er is gesorteerd op de hire_date.

![](figs/clip0226.png)

:::

:::{exercise}
Query 7: Maak een overzicht zoals hieronder. De informatie komt uit de tabel job_grades. De eerste kolom is het grootste verschil tussen highest_sal en lowest_sal, de tweede kolom is het kleinste verschil tussen highest_sal en lowest_sal en de derde kolom is het gemiddelde verschil tussen highest_sal en lowest_sal.

![](figs/clip0227.png)

:::

:::{exercise}
Query 8: Maak onderstaand overzicht na. De informatie komt uit de tabel employees. Het gaat om het aantal rijen. De eerste kolom is het aantal inclusief de NULL en de tweede kolom is het aantal exclusief de NULL waarden bij manager_id.

![](figs/clip0228.png)

:::

:::{exercise}
Query 9: Wat is de gemiddelde bonus van de werknemers als je 'Abel' niet meetelt? Het veld 'bonus' is het laatste veld van de tabel employees.

![](figs/clip0309.png)

:::

:::{exercise}
Query 10: De werknemers van de afdeling sales (de personen met 'SA_MAN' of 'SA_REP' als job_id) krijgen 1,25% opslag. Maak het overzicht zoals hieronder. Er is gesorteerd op achternaam.

 

![](figs/clip0230.png)

:::